Конфигурация/Documents/РаспределениеАктивовЕПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РаспределениеАктивовЕПС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РаспределенияАктивовЕПС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСделке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
								<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/РаспределениеАктивовЕПС/Ext/ManagerModule.bsl
Функция НайтиДокументРаспределениеАктивовЕПСПоСделке(Сделка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РаспределениеАктивовЕПС.Ссылка КАК РаспределениеАктивовЕПС
	|ИЗ
	|	Документ.РаспределениеАктивовЕПС КАК РаспределениеАктивовЕПС
	|ГДЕ
	|	РаспределениеАктивовЕПС.ПоСделке = &Сделка";
	
	Запрос.УстановитьПараметр("Сделка", Сделка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе	
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Возврат ВыборкаДетальныеЗаписи.РаспределениеАктивовЕПС;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция НайтиДокументРаспределениеАктивовЕПСЗаДату(НачальнаяДата, КонечнаяДата, Организация, СчетДоверительногоУправления) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РаспределениеАктивовЕПС.Ссылка КАК РаспределениеАктивовЕПС
	|ИЗ
	|	Документ.РаспределениеАктивовЕПС КАК РаспределениеАктивовЕПС
	|ГДЕ
	|	РаспределениеАктивовЕПС.ПоСделке = ИСТИНА
	|	И РаспределениеАктивовЕПС.Организация = &Организация
	|	И РаспределениеАктивовЕПС.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И РаспределениеАктивовЕПС.Дата МЕЖДУ &НачальнаяДата И &КонечнаяДата";
	
	Запрос.УстановитьПараметр("НачальнаяДата", НачальнаяДата);
	Запрос.УстановитьПараметр("КонечнаяДата", КонечнаяДата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе	
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Возврат ВыборкаДетальныеЗаписи.РаспределениеАктивовЕПС;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРаспределенияАктивовЕПС(Дата, Организация, СчетДоверительногоУправления, ПоСделке, ДокументРаспределениеАктивовЕПС, Сделка, Рынок, ЦеннаяБумага, УчетныйАктивЕПС, Количество, Ответственный, Отказ) Экспорт

	Если ДокументРаспределениеАктивовЕПС = Неопределено Тогда
		
		Если ТипЗнч(ПоСделке) = Тип("ДокументСсылка.Сделка") Тогда
		
			ДокументРаспределениеАктивовЕПССсылка = НайтиДокументРаспределениеАктивовЕПСПоСделке(Сделка);
			
		Иначе
			
			ДокументРаспределениеАктивовЕПССсылка = НайтиДокументРаспределениеАктивовЕПСЗаДату(НачалоДня(Дата), КонецДня(Дата), Организация, СчетДоверительногоУправления);
			
		КонецЕсли;	
			
		Если ДокументРаспределениеАктивовЕПССсылка = Неопределено Тогда
			
			ДокументРаспределениеАктивовЕПС = Документы.РаспределениеАктивовЕПС.СоздатьДокумент();
			
		Иначе
			
			ДокументРаспределениеАктивовЕПС = ДокументРаспределениеАктивовЕПССсылка.ПолучитьОбъект();
			
		КонецЕсли;	
		
		УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ДокументРаспределениеАктивовЕПС);
		
		ДокументРаспределениеАктивовЕПС.Дата = Дата;
		ДокументРаспределениеАктивовЕПС.Организация = Организация;
		ДокументРаспределениеАктивовЕПС.СчетДоверительногоУправления = СчетДоверительногоУправления;
		ДокументРаспределениеАктивовЕПС.ПоСделке = ПоСделке;
		ДокументРаспределениеАктивовЕПС.Ответственный = Ответственный;
		ДокументРаспределениеАктивовЕПС.Комментарий = "";
		
		ДокументРаспределениеАктивовЕПС.ЦенныеБумаги.Очистить();
		
	КонецЕсли;
	
	НоваяСтрокаЦенныеБумаги = ДокументРаспределениеАктивовЕПС.ЦенныеБумаги.Добавить();
	НоваяСтрокаЦенныеБумаги.Рынок           = Рынок;
	НоваяСтрокаЦенныеБумаги.ЦеннаяБумага    = ЦеннаяБумага;
	НоваяСтрокаЦенныеБумаги.Количество      = Количество;
	НоваяСтрокаЦенныеБумаги.Сделка		    = Сделка;
	НоваяСтрокаЦенныеБумаги.УчетныйАктивЕПС = УчетныйАктивЕПС;
	
	Возврат ДокументРаспределениеАктивовЕПС;
	
КонецФункции
